jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
            g_UASampleBuf[i] = *(g_SampleQueueBuf->uA[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_UCSampleBuf[i] = *(g_SampleQueueBuf->uC[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_Udc1SampleBuf[i] = *(g_SampleQueueBuf->udc1[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_Udc2SampleBuf[i] = *(g_SampleQueueBuf->udc2[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
        }
        for (i = 0; i < ADC_SAMPLE_NUM; i++)
        {
            g_UaSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->ua[0]+i);
            g_UbSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->ub[0]+i);
            g_UcSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->uc[0]+i);
            g_U0SampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->u0[0]+i);

            g_IaSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->ia[0]+i);
            g_IbSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->ib[0]+i);
            g_IcSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->ic[0]+i);
            g_I0SampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->i0[0]+i);
            
            g_UASampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->uA[0]+i);
            g_UCSampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->uC[0]+i);
            g_Udc1SampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->udc1[0]+i);
            g_Udc2SampleBuf[ADC_SAMPLE_NUM + i] = *(g_SampleQueueBuf->udc2[0]+i);
        }
    }

    BufDiv(g_UaSampleBuf, FFT_InputBufUa);
    BufDiv(g_UbSampleBuf, FFT_InputBufUb);
    BufDiv(g_UcSampleBuf, FFT_InputBufUc);
    BufDiv(g_U0SampleBuf, FFT_InputBufU0);
    BufDiv(g_IaSampleBuf, FFT_InputBufIa);
    BufDiv(g_IbSampleBuf, FFT_InputBufIb);
    BufDiv(g_IcSampleBuf, FFT_InputBufIc);
    BufDiv(g_I0SampleBuf, FFT_InputBufI0);
    BufDiv(g_UASampleBuf, FFT_InputBufUA);
    BufDiv(g_UCSampleBuf, FFT_InputBufUC);

//    printf("%d\n",(short)UA1_SampleBuf[w]);
    
    for (i = 0; i < CALC_TIMES; i++)
    {
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufUa[i]);	//FFT
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufUb[i]);
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufUc[i]);
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufU0[i]);
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufIa[i]);
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufIb[i]);
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufIc[i]);
	  #ifndef SYNTHESIS_I0_ENABLE
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufI0[i]);
	  #endif		        
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufUA[i]);
        arm_cfft_radix2_f32(&Scfft, FFT_InputBufUC[i]);

        VUa[i] = sqrt(FFT_InputBufUa[i][2] * FFT_InputBufUa[i][2] + FFT_InputBufUa[i][3] * FFT_InputBufUa[i][3]);
        VUb[i] = sqrt(FFT_InputBufUb[i][2] * FFT_InputBufUb[i][2] + FFT_InputBufUb[i][3] * FFT_InputBufUb[i][3]);
        VUc[i] = sqrt(FFT_InputBufUc[i][2] * FFT_InputBufUc[i][2] + FFT_InputBufUc[i][3] * FFT_InputBufUc[i][3]);
        VU0[i] = sqrt(FFT_InputBufU0[i][2] * FFT_InputBufU0[i][2] + FFT_InputBufU0[i][3] * FFT_InputBufU0[i][3]);

        VUa3[i] = sqrt(FFT_InputBufUa[i][6] * FFT_InputBufUa[i][6] + FFT_InputBufUa[i][7] * FFT_InputBufUa[i][7]);
        VUb3[i] = sqrt(FFT_InputBufUb[i][6] * FFT_InputBufUb[i][6] + FFT_InputBufUb[i][7] * FFT_InputBufUb[i][7]);
        VUc3[i] = sqrt(FFT_InputBufUc[i][6] * FFT_InputBufUc[i][6] + FFT_InputBufUc[i][7] * FFT_InputBufUc[i][7]);
        VU03[i] = sqrt(FFT_InputBufU0[i][6] * FFT_InputBufU0[i][6] + FFT_InputBufU0[i][7] * FFT_InputBufU0[i][7]);

        VUa5[i] = sqrt(FFT_InputBufUa[i][10] * FFT_InputBufUa[i][10] + FFT_InputBufUa[i][11] * FFT_InputBufUa[i][11]);
        VUb5[i] = sqrt(FFT_InputBufUb[i][10] * FFT_InputBufUb[i][10] + FFT_InputBufUb[i][11] * FFT_InputBufUb[i][11]);
        VUc5[i] = sqrt(FFT_InputBufUc[i][10] * FFT_InputBufUc[i][10] + FFT_InputBufUc[i][11] * FFT_InputBufUc[i][11]);
        VU05[i] = sqrt(FFT_InputBufU0[i][10] * FFT_InputBufU0[i][10] + FFT_InputBufU0[i][11] * FFT_InputBufU0[i][11]);

        VIa[i] = sqrt(FFT_InputBufIa[i][2] * FFT_InputBufIa[i][2] + FFT_InputBufIa[i][3] * FFT_InputBufIa[i][3]);
        VIb[i] = sqrt(FFT_InputBufIb[i][2] * FFT_InputBufIb[i][2] + FFT_InputBufIb[i][3] * FFT_InputBufIb[i][3]);
        VIc[i] = sqrt(FFT_InputBufIc[i][2] * FFT_InputBufIc[i][2] + FFT_InputBufIc[i][3] * FFT_InputBufIc[i][3]);		
	  #ifdef SYNTHESIS_I0_ENABLE
        FFT_InputBufI0[i][2] += (FFT_InputBufIa[i][2] + FFT_InputBufIb[i][2] + FFT_InputBufIc[i][2]);
        FFT_InputBufI0[i][3] += (FFT_InputBufIa[i][3] + FFT_InputBufIb[i][3] + FFT_InputBufIc[i][3]);
	  #endif	  
        VI0[i] = sqrt(FFT_InputBufI0[i][2] * FFT_InputBufI0[i][2] + FFT_InputBufI0[i][3] * FFT_InputBufI0[i][3]);	

        VIa2[i] = sqrt(FFT_InputBufIa[i][4] * FFT_InputBufIa[i][4] + FFT_InputBufIa[i][5] * FFT_InputBufIa[i][5]);
        VIb2[i] = sqrt(FFT_InputBufIb[i][4] * FFT_InputBufIb[i][4] + FFT_InputBufIb[i][5] * FFT_InputBufIb[i][5]);
        VIc2[i] = sqrt(FFT_InputBufIc[i][4] * FFT_InputBufIc[i][4] + FFT_InputBufIc[i][5] * FFT_InputBufIc[i][5]);
		
        VIa3[i] = sqrt(FFT_InputBufIa[i][6] * FFT_InputBufIa[i][6] + FFT_InputBufIa[i][7] * FFT_InputBufIa[i][7]);
        VIb3[i] = sqrt(FFT_InputBufIb[i][6] * FFT_InputBufIb[i][6] + FFT_InputBufIb[i][7] * FFT_InputBufIb[i][7]);
        VIc3[i] = sqrt(FFT_InputBufIc[i][6] * FFT_InputBufIc[i][6] + FFT_InputBufIc[i][7] * FFT_InputBufIc[i][7]);
	  #ifdef SYNTHESIS_I0_ENABLE
        FFT_InputBufI0[i][6] += (FFT_InputBufIa[i][6] + FFT_InputBufIb[i][6] + FFT_InputBufIc[i][6]);
        FFT_InputBufI0[i][7] += (FFT_InputBufIa[i][7] + FFT_InputBufIb[i][7] + FFT_InputBufIc[i][7]);
	  #endif		
        VI03[i] = sqrt(FFT_InputBufI0[i][6] * FFT_InputBufI0[i][6] + FFT_InputBufI0[i][7] * FFT_InputBufI0[i][7]);
        
        VIa5[i] = sqrt(FFT_InputBufIa[i][10] * FFT_InputBufIa[i][10] + FFT_InputBufIa[i][11] * FFT_InputBufIa[i][11]);
        VIb5[i] = sqrt(FFT_InputBufIb[i][10] * FFT_InputBufIb[i][10] + FFT_InputBufIb[i][11] * FFT_InputBufIb[i][11]);
        VIc5[i] = sqrt(FFT_InputBufIc[i][10] * FFT_InputBufIc[i][10] + FFT_InputBufIc[i][11] * FFT_InputBufIc[i][11]);
	  #ifdef SYNTHESIS_I0_ENABLE
        FFT_InputBufI0[i][10] += (FFT_InputBufIa[i][10] + FFT_InputBufIb[i][10] + FFT_InputBufIc[i][10]);
        FFT_InputBufI0[i][11] += (FFT_InputBufIa[i][11] + FFT_InputBufIb[i][11] + FFT_InputBufIc[i][11]);
	  #endif		
        VI05[i] = sqrt(FFT_InputBufI0[i][10] * FFT_InputBufI0[i][10] + FFT_InputBufI0[i][11] * FFT_InputBufI0[i][11]);
        
        VUA[i] = sqrt(FFT_InputBufUA[i][2] * FFT_InputBufUA[i][2] + FFT_InputBufUA[i][3] * FFT_InputBufUA[i][3]);
        VUC[i] = sqrt(FFT_InputBufUC[i][2] * FFT_InputBufUC[i][2] + FFT_InputBufUC[i][3] * FFT_InputBufUC[i][3]);
    }

//  ParameterCheck(CALIBRATE_FACTOR);
    
    /* 计算UI间角度 */
    if (++k % 10 == 1)
    {
        k = 0;
        g_Alpha[0] = CalculateAngleU_I(FFT_InputBufUa[1][3], FFT_InputBufUa[1][2], FFT_InputBufIa[1][3], FFT_InputBufIa[1][2]) - 0.29f;//g_ParameterDB.Data.calibrateFactor.Str.califactorAlphaUaIa;
        g_Alpha[1] = CalculateAngleU_I(FFT_InputBufUb[1][3], FFT_InputBufUb[1][2], FFT_InputBufIb[1][3], FFT_InputBufIb[1][2]) - 0.29f;//g_ParameterDB.Data.calibrateFactor.Str.califactorAlphaUbIb;
        g_Alpha[2] = CalculateAngleU_I(FFT_InputBufUC[1][3], FFT_InputBufUC[1][2], FFT_InputBufIc[1][3], FFT_InputBufIc[1][2]) - 0.29f;//g_ParameterDB.Data.calibrateFactor.Str.califactorAlphaUcIc;
        g_Alpha[3] = CalculateAngleU_I(FFT_InputBufU0[1][3], FFT_InputBufU0[1][2], FFT_InputBufI0[1][3], FFT_InputBufI0[1][2]) - 0.29f;//g_ParameterDB.Data.calibrateFactor.Str.califactorAlphaU0I0;
		g_Alpha[4] = CalculateAngleU_I(FFT_InputBufUa[1][3], FFT_InputBufUa[1][2], FFT_InputBufUC[1][3], FFT_InputBufUC[1][2]) - g_CalibrateFactor[CALIFACTOR_ALPHA_UaUb];
    }

    Ua = CalcAverage(VUa, CALC_TIMES) * VOLTAGE_RADIO;
    Ub = CalcAverage(VUb, CALC_TIMES) * VOLTAGE_RADIO;
    Uc = CalcAverage(VUc, CALC_TIMES) * VOLTAGE_RADIO;
    U0 = CalcAverage(VU0, CALC_TIMES) * VOLTAGE_RADIO;

    Ua3 = CalcAverage(VUa3, CALC_TIMES) * VOLTAGE_RADIO;
    Ub3 = CalcAverage(VUb3, CALC_TIMES) * VOLTAGE_RADIO;
    Uc3 = CalcAverage(VUc3, CALC_TIMES) * VOLTAGE_RADIO;
    U03 = CalcAverage(VU03, CALC_TIMES) * VOLTAGE_RADIO;

    Ua5 = CalcAverage(VUa5, CALC_TIMES) * VOLTAGE_RADIO;
    Ub5 = CalcAverage(VUb5, CALC_TIMES) * VOLTAGE_RADIO;
    Uc5 = CalcAverage(VUc5, CALC_TIMES) * VOLTAGE_RADIO;
    U05 = CalcAverage(VU05, CALC_TIMES) * VOLTAGE_RADIO;

