jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
    Ia = CalcAverage(VIa, CALC_TIMES) * CURRENT_RADIO;
    Ib = CalcAverage(VIb, CALC_TIMES) * CURRENT_RADIO;
    Ic = CalcAverage(VIc, CALC_TIMES) * CURRENT_RADIO;
    I0 = CalcAverage(VI0, CALC_TIMES) * CURRENT_RADIO;

    //printf("%f  %f  %f\n", Ia,Ib,Uc);
    Ia2 = CalcAverage(VIa2, CALC_TIMES) * CURRENT_RADIO;
    Ib2 = CalcAverage(VIb2, CALC_TIMES) * CURRENT_RADIO;
    Ic2 = CalcAverage(VIc2, CALC_TIMES) * CURRENT_RADIO;
	
    Ia3 = CalcAverage(VIa3, CALC_TIMES) * CURRENT_RADIO;
    Ib3 = CalcAverage(VIb3, CALC_TIMES) * CURRENT_RADIO;
    Ic3 = CalcAverage(VIc3, CALC_TIMES) * CURRENT_RADIO;
    I03 = CalcAverage(VI03, CALC_TIMES) * CURRENT_RADIO;

    Ia5 = CalcAverage(VIa5, CALC_TIMES) * CURRENT_RADIO;
    Ib5 = CalcAverage(VIb5, CALC_TIMES) * CURRENT_RADIO;
    Ic5 = CalcAverage(VIc5, CALC_TIMES) * CURRENT_RADIO;
    I05 = CalcAverage(VI05, CALC_TIMES) * CURRENT_RADIO;
    
    UA = CalcAverage(VUA, CALC_TIMES) * VOLTAGE_RADIO;
    UC = CalcAverage(VUC, CALC_TIMES) * VOLTAGE_RADIO;

	for (i = 0; i < ADC_SAMPLE_NUM; i++)
	{
		Udc1 += g_Udc1SampleBuf[i];
		Udc2 += g_Udc2SampleBuf[i];
	}   
	
	Udc1 /= ADC_SAMPLE_NUM;
	Udc2 /= ADC_SAMPLE_NUM;
	
    Ua = Ua * g_CalibrateFactor[CALIFACTOR_Uab];
    Ua3 = Ua3 * g_CalibrateFactor[CALIFACTOR_Uab];
    Ua5 = Ua5 * g_CalibrateFactor[CALIFACTOR_Uab];
    Ub = Ub * g_CalibrateFactor[CALIFACTOR_Uca];
    Ub3 = Ub3 * g_CalibrateFactor[CALIFACTOR_Uca];
    Ub5 = Ub5 * g_CalibrateFactor[CALIFACTOR_Uca];    
    Uc = Uc * g_CalibrateFactor[CALIFACTOR_Ubc];
    Uc3 = Uc3 * g_CalibrateFactor[CALIFACTOR_Ubc];
    Uc5 = Uc5 * g_CalibrateFactor[CALIFACTOR_Ubc];    
    U0 = U0 * g_CalibrateFactor[CALIFACTOR_U0];
    U03 = U03 * g_CalibrateFactor[CALIFACTOR_U0];
    U05 = U05 * g_CalibrateFactor[CALIFACTOR_U0];    
    Ia = Ia * g_CalibrateFactor[CALIFACTOR_Ia];
	Ia2 = Ia2 * g_CalibrateFactor[CALIFACTOR_Ia];
    Ia3 = Ia3 * g_CalibrateFactor[CALIFACTOR_Ia];
    Ia5 = Ia5 * g_CalibrateFactor[CALIFACTOR_Ia];    
    Ib = Ib * g_CalibrateFactor[CALIFACTOR_Ib];
	Ib2 = Ib2 * g_CalibrateFactor[CALIFACTOR_Ib];
    Ib3 = Ib3 * g_CalibrateFactor[CALIFACTOR_Ib];
    Ib5 = Ib5 * g_CalibrateFactor[CALIFACTOR_Ib];    
    Ic = Ic * g_CalibrateFactor[CALIFACTOR_Ic];
	Ic2 = Ic2 * g_CalibrateFactor[CALIFACTOR_Ic];
    Ic3 = Ic3 * g_CalibrateFactor[CALIFACTOR_Ic];
    Ic5 = Ic5 * g_CalibrateFactor[CALIFACTOR_Ic];    
    I0 = I0 * g_CalibrateFactor[CALIFACTOR_I0];
    I03 = I03 * g_CalibrateFactor[CALIFACTOR_I0];
    I05 = I05 * g_CalibrateFactor[CALIFACTOR_I0];    
    UA = UA * g_CalibrateFactor[CALIFACTOR_UAB];
    UC = UC * g_CalibrateFactor[CALIFACTOR_UBC];   
    Udc1 = Udc1 * g_CalibrateFactor[CALIFACTOR_DC1];
    Udc2 = Udc2 * g_CalibrateFactor[CALIFACTOR_DC2];  

//    ParameterCheck(ZERODRIFT);

    if (Ua < g_Parameter[ZERODRIFT_Uab])Ua = 0;
    if (Ub < g_Parameter[ZERODRIFT_Uca])Ub = 0;
    if (Uc < g_Parameter[ZERODRIFT_Ubc])Uc = 0;
    if (U0 < g_Parameter[ZERODRIFT_U0]) U0 = 0;
    if (Ia < g_Parameter[ZERODRIFT_Ia]) Ia = 0;
    if (Ib < g_Parameter[ZERODRIFT_Ib]) Ib = 0;
    if (Ic < g_Parameter[ZERODRIFT_Ic]) Ic = 0;
    if (I0 < g_Parameter[ZERODRIFT_I0]) I0 = 0;
    if (UA < g_Parameter[ZERODRIFT_UAB])UA = 0;
    if (UC < g_Parameter[ZERODRIFT_UBC])UC = 0;
    if (Udc1 < g_Parameter[ZERODRIFT_DC1])Udc1 = 0;
    if (Udc2 < g_Parameter[ZERODRIFT_DC2])Udc2 = 0;

    Pa = Ua * Ia * cos(g_Alpha[0] * FACTOR_ANGLE_TO_RAD);
    Pb = 0; //Ub * Ib * cos(g_Alpha[1] * FACTOR_ANGLE_TO_RAD);
    Pc = UC * Ic * cos(g_Alpha[2] * FACTOR_ANGLE_TO_RAD);
    P = (Pa + Pb + Pc) / 1000.0f;

    Qa = Ua * Ia * sin(g_Alpha[0] * FACTOR_ANGLE_TO_RAD);
    Qb = 0; //Ub * Ib * sin(g_Alpha[1] * FACTOR_ANGLE_TO_RAD);
    Qc = UC * Ic * sin(g_Alpha[2] * FACTOR_ANGLE_TO_RAD);
    Q = (Qa + Qb + Qc) / 1000.0f;

    S = sqrt(P * P + Q * Q);
    F = P / S;

    P = fabs(P) < g_Parameter[ZERODRIFT_P] ? 0 : P;
    Q = fabs(Q) < g_Parameter[ZERODRIFT_Q] ? 0 : Q;
    S = fabs(S) < g_Parameter[ZERODRIFT_S] ? 0 : S;

    g_TelemetryDB[ADDR_Uab]= Ua;
    g_TelemetryDB[ADDR_Ubc] = Uc;
    g_TelemetryDB[ADDR_Uca] = Ub;
    g_TelemetryDB[ADDR_Uca] = U0;

    g_TelemetryDB[ADDR_UAB] = UA;
    g_TelemetryDB[ADDR_UBC] = UC;
    
    g_TelemetryDB[ADDR_IA] = Ia;
    g_TelemetryDB[ADDR_IB] = Ib;
    g_TelemetryDB[ADDR_IC] = Ic;
    g_TelemetryDB[ADDR_I0] = I0;

    g_TelemetryDB[ADDR_P] = P;
    g_TelemetryDB[ADDR_Q] = Q;
    g_TelemetryDB[ADDR_S] = S;
    g_TelemetryDB[ADDR_PF] = F;

	g_TelemetryDB[ADDR_DC1] = Udc1;
	g_TelemetryDB[ADDR_DC2] = Udc2;
	
    if((g_TelemetryDB[ADDR_U0] == 0)||(g_TelemetryDB[ADDR_I0] == 0))
    {g_TelemetryDB[ADDR_AIPHY_U0_I0] = 0;}
    else       
    {
//        while(g_Alpha[3]<-180)
//        {g_Alpha[3] += 360;}
//        while(g_Alpha[3]>180)
//        {g_Alpha[3] -= 360;}
        g_TelemetryDB[ADDR_AIPHY_U0_I0] = g_Alpha[3];
    }

	if((g_TelemetryDB[ADDR_Uab] == 0)||(g_TelemetryDB[ADDR_UBC] == 0))
    {g_TelemetryDB[ADDR_ALPHY_Uab_UBC] = 0;}
    else       
    {
        if(g_Alpha[4]<-180)
        {g_Alpha[4] += 360;}
        if(g_Alpha[4]>180)
        {g_Alpha[4] -= 360;}
        g_TelemetryDB[ADDR_ALPHY_Uab_UBC] = g_Alpha[4];
    }
	
    g_TelemetryDB[ADDR_Uab_ONCE] = Ua * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_Ubc_ONCE] = Uc * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_Uca_ONCE] = Ub * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_U0_ONCE] = U0 * (g_Parameter[RATIO_U0_ONE_TURN] / g_Parameter[RATIO_U0_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_UBC_ONCE] = UC * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_UAB_ONCE] = UA * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
	
    g_TelemetryDB[ADDR_Ia_ONCE] = Ia * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_Ib_ONCE] = Ib * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);    
    g_TelemetryDB[ADDR_Ic_ONCE] = Ic * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_I0_ONCE] = I0 * (g_Parameter[RATIO_I0_ONE_TURN] / g_Parameter[RATIO_I0_SECONDARY]);

    g_TelemetryDB[ADDR_P_ONCE] = P * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_Q_ONCE] = Q * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_S_ONCE] = S * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);

    if (Ua3 < g_Parameter[ZERODRIFT_Uab])Ua3 = 0;
    if (Ub3 < g_Parameter[ZERODRIFT_Uca])Ub3 = 0;
    if (Uc3 < g_Parameter[ZERODRIFT_Ubc])Uc3 = 0;
    if (U03 < g_Parameter[ZERODRIFT_U0]) U03 = 0;
	
	if (Ia2 < g_Parameter[ZERODRIFT_Ia]) Ia2 = 0;
	if (Ib2 < g_Parameter[ZERODRIFT_Ib]) Ib2 = 0;
	if (Ic2 < g_Parameter[ZERODRIFT_Ic]) Ic2 = 0;
	
    if (Ia3 < g_Parameter[ZERODRIFT_Ia]) Ia3 = 0;
    if (Ib3 < g_Parameter[ZERODRIFT_Ib]) Ib3 = 0;
    if (Ic3 < g_Parameter[ZERODRIFT_Ic]) Ic3 = 0;
    if (I03 < g_Parameter[ZERODRIFT_I0]) I03 = 0;

    if (Ua5 < g_Parameter[ZERODRIFT_Uab])Ua5 = 0;
    if (Ub5 < g_Parameter[ZERODRIFT_Uca])Ub5 = 0;
    if (Uc5 < g_Parameter[ZERODRIFT_Ubc])Uc5 = 0;
    if (U05 < g_Parameter[ZERODRIFT_U0]) U05 = 0;
    if (Ia5 < g_Parameter[ZERODRIFT_Ia]) Ia5 = 0;
    if (Ib5 < g_Parameter[ZERODRIFT_Ib]) Ib5 = 0;
    if (Ic5 < g_Parameter[ZERODRIFT_Ic]) Ic5 = 0;
    if (I05 < g_Parameter[ZERODRIFT_I0]) I05 = 0;

    g_secondHarmonicIa = Ia2;
	g_secondHarmonicIb = Ib2;
	g_secondHarmonicIc = Ic2;
    
