jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
	g_TelemetryDB[THIRDHARMONIC_Uab] = Ua3;    
    g_TelemetryDB[THIRDHARMONIC_Ubc] = Uc3;
    g_TelemetryDB[THIRDHARMONIC_Uca] = Ub3;
    g_TelemetryDB[THIRDHARMONIC_U0] = U03;
    g_TelemetryDB[THIRDHARMONIC_Ia] = Ia3;
    g_TelemetryDB[THIRDHARMONIC_Ib] = Ib3;
    g_TelemetryDB[THIRDHARMONIC_Ic] = Ic3;
    g_TelemetryDB[THIRDHARMONIC_I0] = I03;

    g_TelemetryDB[THIRDHARMONIC_Uab] = Ua5;
    g_TelemetryDB[THIRDHARMONIC_Ubc] = Uc5;
    g_TelemetryDB[THIRDHARMONIC_Uca] = Ub5;
    g_TelemetryDB[THIRDHARMONIC_U0] = U05;
    g_TelemetryDB[THIRDHARMONIC_Ia] = Ia5;
    g_TelemetryDB[THIRDHARMONIC_Ib] = Ib5;
    g_TelemetryDB[THIRDHARMONIC_Ic] = Ic5;
    g_TelemetryDB[THIRDHARMONIC_I0] = I05;
    
#if RT_USING_TELEMETRY_SET    
    for (i = 0; i < TELEMETRY_TOTAL_NUM; i++)
    {
        if (g_TelemetrySetEnable.buf[i] == SWITCH_ON)
        {
            g_TelemetryDB[i] = g_TelemetrySetValue.buf[i];
        }
    }
#endif /* RT_USING_TELEMETRY_SET */ 
}


/* PUBLIC FUNCTION PROTOTYPES ------------------------------------------------*/
/**
  * @Description: AD7606采样值初始化.
  * @param:  无
  * @return: 无
  */
int calculate_init(void)
{
    arm_cfft_radix2_init_f32(&Scfft, 32, 0, 1); // 初始化Scfft结构体
    	
    return(RT_EOK);     
}
INIT_BOARD_EXPORT(calculate_init);

/**
  * @Description: 计算任务.
  * @param:  无
  * @return: 无
  * @updata: [YYYY-MM-DD] [更改人姓名][变更描述]
  */
void CalcultateTask(void)
{
    CalculateData();

    /* 系数校准 */
    CalibrationFactorCal(CALIFACTOR_NUM);
}

/* END OF FILE ---------------------------------------------------------------*/
